SvOlli/sorbus/src/rp2040/native/core1.c
static inline uint32_t getaddr( uint32_t _state )
{
   return (_state & bus_config.mask_address) >> (bus_config.shift_address);
}


static inline uint32_t getdata( uint32_t _state )
{
   return (_state & bus_config.mask_data) >> (bus_config.shift_data);
}


uint32_t debug_getbus( int i )
{
   uint32_t state = buslog_states[(i + buslog_index) & (count_of(buslog_states)-1)];
   uint32_t prev2 = buslog_states[(i + buslog_index - 2) & (count_of(buslog_states)-1)];
   uint32_t prev  = buslog_states[(i + buslog_index - 1) & (count_of(buslog_states)-1)];
   uint32_t next  = buslog_states[(i + buslog_index + 1) & (count_of(buslog_states)-1)];

   bool has_follow = ((getaddr( state ) + 1) == getaddr( next ));
   bool is_read = (state & bus_config.mask_rw) && (next & bus_config.mask_rw);
   bool is_follow = ((getaddr( prev ) + 1) == getaddr( state ));
   bool is_rts_stack = (getdata( prev2 ) == 0x60 );
   if( is_read && has_follow && !is_follow && !is_rts_stack )
   {
      state |= 0x80000000;
   }
   return state;
}



void debug_backtrace()
{
   static const int numstates = count_of(buslog_states);
   printf( "system trap triggered, last cpu actions:\n" );
   uint32_t _state, _state1, _state2, _state3;
   for( int i = 0; i < numstates; ++i )
   {
      //uint32_t _state = buslog_states[(i + buslog_index) & (count_of(buslog_states)-1)];
      _state = debug_getbus( i );
      _state1 = debug_getbus( (i+1) & (numstates-1) );
      if( (_state & bus_config.mask_data) >> (bus_config.shift_data) == 0x20 )
      {
         if( cputype == CPU_65CE02 )
         {
            _state2 = debug_getbus( (i+4) & (numstates-1) );
         }
         else
         {
            _state2 = debug_getbus( (i+5) & (numstates-1) );
         }
      }
      else
      {
         _state2 = debug_getbus( (i+2) & (numstates-1) );
      }
      _state3 = debug_getbus( (i+3) & (numstates-1) );
      debug_dump_state( count_of(buslog_states)-i, _state, _state1, _state2, _state3 );
   }
   debug_dump_state( 0, gpio_get_all(), 0, 0, 0 );
}


const char* debug_handler_name( queue_event_handler_t h )
{
   if( h == event_clear_reset )
   {
      return "event_clear_reset";
   }
   if( h == event_estimate_cpufreq )
   {
      return "event_estimate_cpufreq";
   }
   if( h == event_flash_sync )
   {
      return "event_flash_sync";
   }
   if( h == event_timer_irq )
   {
      return "event_timer_irq";
   }
   if( h == event_timer_nmi )
   {
      return "event_timer_nmi";
   }
   if( h == event_watchdog )
   {
      return "event_watchdog";
   }
}


void debug_queue_event( const char *text )
{
   queue_event_t *event;
   int i = 0;
   printf( "%s: %016llx:%016llx\n", text, _queue_cycle_counter, _queue_next_timestamp );
   for( event = _queue_next_event; event; event = event->next )
   {
      printf( "%02d:%016llx:%p:%-24s:%08x\n",
              i++,
              event->timestamp,
              event->handler,
              debug_handler_name( event->handler ),
              event->data );
   }
   printf( "done.\n" );
}

void debug_clocks()
{
   char cpu_clk[] = "                     ";
   uint f_pll_sys  = frequency_count_khz(CLOCKS_FC0_SRC_VALUE_PLL_SYS_CLKSRC_PRIMARY);
   uint f_pll_usb  = frequency_count_khz(CLOCKS_FC0_SRC_VALUE_PLL_USB_CLKSRC_PRIMARY);
   uint f_rosc     = frequency_count_khz(CLOCKS_FC0_SRC_VALUE_ROSC_CLKSRC);
   uint f_clk_sys  = frequency_count_khz(CLOCKS_FC0_SRC_VALUE_CLK_SYS);
   uint f_clk_peri = frequency_count_khz(CLOCKS_FC0_SRC_VALUE_CLK_PERI);
   uint f_clk_usb  = frequency_count_khz(CLOCKS_FC0_SRC_VALUE_CLK_USB);
   uint f_clk_adc  = frequency_count_khz(CLOCKS_FC0_SRC_VALUE_CLK_ADC);
   uint f_clk_rtc  = frequency_count_khz(CLOCKS_FC0_SRC_VALUE_CLK_RTC);
   uint time_hz = (double)1000000.0 / ((double)(time_per_mcc) / CLOCKS_PER_SEC / 10000);

   cpu_clk[snprintf( &cpu_clk[0], sizeof(cpu_clk)-1, "%s CLK:", cputype_name( cputype ) )] = ' ';
   printf("\n");
   printf("PLL_SYS:             %3d.%03dMHz\n", f_pll_sys / 1000, f_pll_sys % 1000 );
   printf("PLL_USB:             %3d.%03dMHz\n", f_pll_usb / 1000, f_pll_usb % 1000 );
   printf("ROSC:                %3d.%03dMHz\n", f_rosc    / 1000, f_rosc    % 1000 );
   printf("CLK_SYS:             %3d.%03dMHz\n", f_clk_sys / 1000, f_clk_sys % 1000 );
   printf("CLK_PERI:            %3d.%03dMHz\n", f_clk_peri / 1000, f_clk_peri % 1000 );
   printf("CLK_USB:             %3d.%03dMHz\n", f_clk_usb / 1000, f_clk_usb % 1000 );
   printf("CLK_ADC:             %3d.%03dMHz\n", f_clk_adc / 1000, f_clk_adc % 1000 );
   printf("CLK_RTC:             %3d.%03dMHz\n", f_clk_rtc / 1000, f_clk_rtc % 1000 );
   printf("%s%3d.%06dMHz\n", cpu_clk, time_hz / 1000000, time_hz % 1000000 );
}


void debug_heap()
{
   extern char __StackLimit, __bss_end__;
   struct mallinfo m = mallinfo();

   uint32_t total_heap = &__StackLimit  - &__bss_end__;
   uint32_t free_heap = total_heap - m.uordblks;

   printf("\n");
   printf( "total heap: %08x (%d)\n", total_heap, total_heap );
   printf( "free  heap: %08x (%d)\n", free_heap,  free_heap );
}


void debug_hexdump( uint8_t *memory, uint32_t size, uint16_t address )
{
   for( uint32_t i = 0; i < size; i += 0x10 )
   {
      printf( "%04x:", address + i );

      for( uint8_t j = 0; j < 0x10; ++j )
      {
         uint16_t a = address + i + j;
         if( (i + j) > size )
         {
            while( j < 0x10 )
            {
               printf( "   " );
               ++j;
            }
            break;
         }
         printf( " %02x", memory[a] );
      }
      printf( "  " );
      for( uint8_t j = 0; j < 0x10; ++j )
      {
         uint16_t a = address + i + j;
         if( (i + j) > size )
         {
            break;
         }
         uint8_t v = memory[a];
         if( (v >= 32) && (v <= 127) )
         {
            printf( "%c", v );
         }
         else
         {
            printf( "." );
         }
      }

      printf( "\n" );
   }
}


void debug_internal_drive()
{
   dhara_flash_info_t dhara_info;
   uint8_t dhara_buffer[SECTOR_SIZE];
   uint16_t dhara_sector = 0;

